Table of Contents
 Class ProjectContentServerHandler
Namespace
IdeaStatiCa.Plugin.ProjectContent
Assembly
IdeaStatiCa.Plugin.dll
Responsible for accessing to data of a project
public class ProjectContentServerHandler : IGrpcMessageHandler
Inheritance
object
ProjectContentServerHandler
Implements
IGrpcMessageHandler
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Constructors
 ProjectContentServerHandler(IProjectContent)
public ProjectContentServerHandler(IProjectContent projectContent)
Parameters
projectContent IProjectContent
Properties
 ContentSource
Get or set the source of data
public IProjectContent ContentSource { get; }
Property Value
IProjectContent
Methods
 HandleClientMessage(GrpcMessage, IGrpcSender)
Handles response incoming from the server.
public Task<object> HandleClientMessage(GrpcMessage message, IGrpcSender grpcSender)
Parameters
message GrpcMessage
grpcSender IGrpcSender
Returns
Task<object>
 HandleServerMessage(GrpcMessage, IGrpcSender)
Invoke methods implemented in the instance contentSource and send result back to a caller by server
public Task<object> HandleServerMessage(GrpcMessage message, IGrpcSender grpcSender)
Parameters
message GrpcMessage
Request
grpcSender IGrpcSender
Returns
Task<object>
 Edit this page